Notes/sampleDataFiles/salesForceSamples/core calls/login.xml

<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope xmlns:soapenv=" http://schemas.xmlsoap.org/soap/envelope/ " xmlns:urn="urn:enterprise.soap.sforce.com">
        <soapenv:Body>
            <urn:login>
                <urn:username><b>user@domain.com</b></urn:username>
                <urn:password><b>secret</b></urn:password>
            </urn:login>
        </soapenv:Body>
    </soapenv:Envelope>